Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་གྱི་ཞབས་གཡས་པའི་མཐེ་བོས་ལ་རེག་པ་ན་ཡང་འདི་བཞིན་དུ་དེའི་ཚེ་ས་གཡོས་པར་གྱུར། དེའི་ཚེ་འདི་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཡང་ལག་མཐིལ་བཞིན་དུ་མཉམ་པར་འདུག །འདི་བཞིན་དུ་སྣང་བ་དང་ས་གཡོ་བས་སྐྲག་པ་སྐྱེས་ཏེ། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་ཐམས་ཅད་ཕྱོགས་བཞིར་བལྟ་ཞིང་མདའ་རྒྱང་གང་ཙམ་ན་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་དེ་མཐོང་ནས་ཐལ་མོ་སྦྱར་ཏེ། རིགས་ཀྱི་བུ་དག་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་དེས་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་གསུངས་སོ། །འདི་ལྟ་སྟེ། ཛ་ལོ་ཀེ། ཛ་ལོ་ཀེ། མོ་ཀེ། ཛ་ལི། ཛ་ལ། ཛ་ལི་ནི། ཛ་ལ་པྲ་ཏེ། ཛ་ཧི་ལི། བ་ར་པུ་རུ་ཥ་ལཀྵ་ཎ་ས་མཱ་རུ་ཧྱ། ཨ་མ་མེ། ཨ་མ་མེ། བ་མ་མེ། བ་མ་མེ། ན་བ་མེ། མ་ཧཱ་མེ། ཛ་ཧ་མེ། ཛ་ཧ་མེ། ཛ་ཧ་མེ། བ་ར་མེ། བ་ར་མེ། བ་བ་བེ། བ་བ་བེ། བ་ཧ་བེ། བང་ག་བེ། བ་ཛ་བེ། བཱ་ར་བཱ་ར་ཤེ །ཛ་ལ་མེ་ཁ། བ་ར་ཁ། ཨ་ལ་ཛ་ཧི་ལི། ཛན་ཏུ་ལེ། ཛན་ཏུ་མུ་ཁེ། བ་ཧ་ར། བ་ཧ་ར། སིདྡྷཔྲ་ཏེ། ནན་ཏི་ལཱ། ནན་ཏི་ན་དཱ་ལཱ། སཱུརྱ་བི་ཧ་ཁ།
en: The thus-gone Śākyamuni then recited the Ratnaketu dhāraṇī:

source: ཙན་དྲ་བི་ཧ་ཁ། ཙཀྵུར་ཛྱོ་ཏི་ཤ་བི་ཧ་ཁ། སརྦ་ཀྵ་ཡ། སྟྲཱི་དྭཱ་སུ་ར་བི་ཧ་ཁ། ཛ་ཁ་ག །ཛ་ཁ་ག །སུ་ར་ཁ་ག །པི་ཧ་མ། ཨ་མྲྀ་ཁ། ཨ་མྲྀ་ཁ། ཨ་མྲྀ་ཁ། ཨ་མྲྀ་ཁ། ཨ་མྲྀ་ཁ། ཨ་མྲྀ་ཁ། ཨ་མྲྀ་ཁ། ཨ་མྲྀ་ཁ། མྲྀ་ཁ། མྲྀ་ཁ། མྲྀ་ཁ། བྱ་བ་ཙྪེ་ད་ཀརྨ། དུ་ནེ་དུ་ནེ། ཨུད་པཱ་ད་བྱ་བཙྪེ་ད་ཛྙཱ་ན་ཀྲྀ་ཏ། ཨ་ནུ་ད་པཱ་ད། ཁ་ག་ནེ་རུ་ཀ །ཨང་གུ་ལེ། བྷང་གུ་ལེ། བི་བྷང་གུ་ལེ། ཀུ་ལ་ཧ། ཨིན་དྲ་པ་རི་བི་བཱ་ཧ། བྱ་བཙྪེ་ད་གར་བྷ། ཙ་པྲ་ཏི། ཙ་པྲ་ཏི། ཨ་མོ་ཧ། དར་ཤ་ནེ། པ་རི་བརྟ་བྷ་ཥྱ། ཁ་ས་མ། ཀྲྀ་ཏ། ཛྱོ་ཏི་ཁ་ག །ཛ་ཧི། ཛ་ཧ། ཛྱོ་ཏི། ནི་ཥྐ་བྷི་ར་ས། བྷི་ར་ས། བྷཱི་ར་ས། བྷཱི་ར་ས། བྷཱི་ར་ཛ། མ་ཏྲི་ཀྲ་མ། བྷ་བ་ཀྲྀ་པ། མ་ཧ་ཀྲྀ་པ། ཧི་ལེ། ཧི་ཧི་ལེ། ཨ་རུ་ན་པྲ་ཏེ། ས་མ་ཡ་ནི་ཥྐ། ད་མ། དཱ་ན། དྷྱན་ཨ་པ་རཱ་མྲཱི་ཥེ། ཕ་ལ་ཀུཎ་ཌ་ལ་ལ་ཁེ། ནི་བརྟ། ཨིཥྚ། བྷ་བ་ཀརྨཀྵ་ཡ། པྲ་དུར་བྷ་བ། པུ་རུ་ཥ་ཏྭ་མ། ཨ་ས་མ་ས་མ།
en: jaloke jaloke moke jali jala jalini jalavrate jahile vara­puruṣa­lakṣaṇa­samāruhya amame vamame vamame navame mahāse jahame jahame jahame jahame varame varame vavave vavave vahave vaṅgave vajave vāra vāraśe jala­mekha parakha ala jahili jana tule jana tubhukhe vahara vahara siṃha vrate nana tilā nana tina dālā sūrya­vihaga candravihaga cakṣu rajyati śavihaga sarva­kṣaya­stritvasura­vihaga jakhaga jakhaga surakhaga vahama amrikha amrikha amrikha amrikha amrikha amrikha amrikha amrikha mrikha mrikha mrikha vyavadeta karma dune dune utpata vyavaccheda jñāna­kṛta anuda padākhaga neruka aṅgule bhaṅgule vibhaṅgule kulaha indra­parivibhaha vyavaccheda karabha vavrati vavrati ca prati ca prati amoha darśane parivarta bhaṣyu khasama krimajyoti­khaga jahi jahi jyoti niṣka bhirasa bhirasa bhirasa bhiraja mati­krama bhivakriva mahākriva hile hihile aruṇavarte samaya­niṣke damadāna­dhyāna aparāmṛśe phala­kuṇḍalalakhe nivarta istribhāva karma­kṣaya prādurbhava puruṣatvam asamasama samaya vidijña tathāgata svāhā!

source: ས་མ་ཡ། བི་བྷིད་དི་ཛྙཱ་ཏ་ཐཱ་ག་ཏ་སྭཱ་ཧཱ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་བཤད་མ་ཐག་ཏུ་ཡང་ས་ཆེན་པོ་གཡོས་སོ།
en: As soon as the thus-gone Śākyamuni recited the Ratnaketu dhāraṇī, this great earth shook again.

source: །བདུད་ཀྱི་བུ་མོ་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་ཀྱང་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་ཐོས་མ་ཐག་ཏུ་མོ་མཚན་མི་སྣང་བར་གྱུར་ཏེ་ཕོ་མཚན་སྐྱེས་སོ།
en: Through hearing the dhāraṇī, the five hundred daughters of Māra lost their female sex organs and grew the corresponding male organs.

source: །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་དག་གི་བུ་མོ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱང་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་ཐོས་མ་ཐག་ཏུ་མོ་མཚན་མི་སྣང་བར་གྱུར་ཏེ་ཕོ་མཚན་སྐྱེས་ནས།
en: The same happened to infinite numbers of girls from the realms of the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, pretas, piśācas, and kumbhāṇḍas.

source: དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏེ།
en: All of them became non-returners on the path to unsurpassed and perfect awakening.

source: ཐམས་ཅད་ཀྱང་མ་འོངས་པ་ན་བུད་མེད་ཀྱི་དངོས་པོ་ཐོབ་པར་འགྱུར་བའི་ལས་ཀྱི་སྒྲིབ་པ་མ་ལུས་པ་བྱང་ནས།
en: For all of them, the karmic obstacle that would cause their being reborn as women in the future was completely removed.

source: བུད་མེད་དེ་དག་ཐམས་ཅད་ཀྱིས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་ཕྱག་འཚལ་ཞིང་སྐད་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ངོ་མཚར་མཛད་པ་ལ་ཕྱག་འཚལ་ལོ་ཕྱག་འཚལ་ལོ།
en: All these women saluted the thus-gone Śākyamuni with folded hands and, in a strong voice, exclaimed, “Homage, homage to Śākyamuni, the miracle worker, the thus-gone, worthy, perfect buddha!

source: །ཐུགས་རྗེ་ཆེན་པོ་གང་གིས་བདག་ཅག་ད་ལྟར་བུད་མེད་ཀྱི་དངོས་པོ་མི་གདའ་བར་གྱུར་ཅིང་། རྣམ་པ་ཐམས་ཅད་རྫོགས་པའི་སྐྱེས་པའི་དངོས་པོར་གྱུར་པའི་སྔོན་བྱུང་བ་འདི་རྒྱ་ཆེར་བཤད་དུ་གསོལ།
en: Please relate in full, O compassionate one, the episode from your past life that will explain how and why our womanhood has now disappeared and we have become men with complete male physiques.

source: དེ་ལྟ་བུའི་ངོ་མཚར་དང་། ཆོ་འཕྲུལ་དང་། སྐྱོ་བས་བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱིའོ།
en: By the power of this miracle, this magical display, and our disenchantment, we have now engendered a wish to attain unsurpassed and perfect awakening.

source: །བཅོམ་ལྡན་འདས་སྔོན་བྱུང་བ་འདི་ལྷ་དང་མི་དཔག་ཏུ་མ་མཆིས་པ་རྣམས་དཔང་དུ་འགྱུར་བར་བཤད་དུ་གསོལ།
en: Narrate, O Blessed One, this episode from your past life, with these countless gods and humans as witnesses.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་སྔོན་བྱུང་བ་འདི་བཤད་པ།
en: The blessed, thus-gone Śākyamuni then continued with the narration of his past life:

source: བཞིན་བཟངས་དག་གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་དེའི་ཐད་ནས་རྒྱལ་པོ་ཨུད་པ་ལའི་གདོང་གི་བཙུན་མོ་དམ་པ་ལྷ་མཛེས་བུད་མེད་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་བཅས་པས་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་ཐོས་ཏེ།
en: “Listen, good people! Together with Her Majesty Surasundarī, the chief queen of King Utpalavaktra, eighty-four thousand women from her retinue heard the Ratnaketu dhāraṇī from the thus-gone Splendorous with the Gentle Glow of Light and Fragrance.

source: ཐོས་མ་ཐག་ཏུ་བཙུན་མོ་དམ་པ་ལྷ་མཛེས་དང་། བུད་མེད་བརྒྱད་ཁྲི་བཞི་སྟོང་དེ་དག་མོ་མཚན་མི་སྣང་བར་གྱུར་ཏེ་ཕོ་མཚན་སྐྱེས་པ་དེའི་ཚེ་དེ་བཞིན་དུ་ལྷའི་བུ་མོ་ནས་མིའི་བུ་མོའི་བར་དུ་གྲངས་མེད། དཔག་ཏུ་མེད་པ་དག་རིན་པོ་ཆེའི་ཏོག་གི་གཟུངས་འདི་ཐོས་མ་ཐག་ཏུ་བུད་མེད་ཀྱི་དབང་པོ་མི་སྣང་བར་གྱུར་ནས་སྐྱེས་པའི་དབང་པོ་སྐྱེས་ཏེ།
en: As soon as they heard it, their female sex organs disappeared, and the corresponding male organs appeared. Simultaneously, the same happened to infinite numbers of girls—the celestial ones, . . . up to humans and nonhumans.

source: བུད་མེད་དེ་དག་ཐམས་ཅད་མ་འོངས་པ་ན་བུད་མེད་ཀྱི་དངོས་པོ་ཐོབ་པར་འགྱུར་བའི་ལས་ཀྱི་སྒྲིབ་པ་མ་ལུས་པར་བྱང་ངོ་།
en: For all of them, the karmic obstacle that would cause their being reborn as women in the future was completely removed.

source: །གང་གི་ཚེ་རྒྱལ་པོ་ཨུད་པ་ལའི་གདོང་གི་བཙུན་མོ་དམ་པ་ལྷ་མཛེས་བཙུན་མོའི་འཁོར་དང་གཡོག་ཏུ་བཅས་པ་ཕོར་གྱུར་པ་དེའི་ཚེ་རྒྱལ་པོ་ཨུད་པ་ལའི་གདོང་དེས་བུ་ཐུ་བོ་གླིང་བཞི་ལ་དབང་བའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་དབང་བསྐུར་བས་དབང་བསྐུར་ཏེ། བུ་སྟོང་དུ་གཅིག་གིས་མ་ཚང་བ་དང་། སྐྱེས་བུ་ཆེན་པོ་ལྷ་མཛེས་དང་བཅས། ལྷ་མཛེས་ཀྱང་སྐྱེས་བུ་ཆེན་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་བཅས། གཞན་ཡང་སྲོག་ཆགས་དགུ་ཁྲི་ཉིས་སྟོང་དང་བཅས་ཏེ་ཁྱིམ་ནས་བྱུང་སྟེ། དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་དེའི་ཐད་དུ་སྐྲ་དང་། ཁ་སྤུ་བྲེགས། གོས་ངུར་སྨྲིག་བགོས་ཏེ་ཡང་དག་པར་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་།
en: “When Surasundarī, the chief queen of King Utpalavaktra, along with her retinue attained the state of manhood, then Utpalavaktra, the universal monarch and the ruler of the four continents, consecrated his eldest son to kingship and, together with his remaining nine hundred and ninety-nine divinely beautiful august sons, eighty-four thousand other such men, and ninety-two thousand other individuals, renounced worldly life and, in the presence of the thus-gone Splendorous with the Gentle Glow of Light and Fragrance, they shaved off their hair and beards and donned monk’s robes, embracing, with complete faith, the life of an ascetic who goes forth from home to homelessness.

source: །རབ་ཏུ་བྱུང་ནས་ཁ་ཏོན་ལ་དགའ་ཞིང་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ལ་བརྩོན་པར་གྱུར་ཏོ།
en: Having thus become a wandering mendicant, he engaged in inward contemplation and took delight in reciting prayers.

source: །དེ་ནས་དེ་ན་སྲོག་ཆགས་བྱེ་བ་མང་པོ་འདི་སྙམ་དུ་སེམས་ཏེ། ཅིའི་ཕྱིར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རབ་ཏུ་བྱུང་སྙམ་ནས།
en: “At that time many tens of millions of beings wondered why their king, the universal monarch, had become a wandering mendicant.

source: དེ་དག་ཕན་ཚུན་འདི་སྐད་ཅེས་སྨྲའོ། །དགེ་སྦྱོང་འདི་ནི་བདུད་ཀྱི་ལས་ལ་བརྩོན་པ་སྟེ།
en: They remarked to each other, ‘That thus-gone one is a rogue and a trickster who engages in the works of Māra

source: གཡོ་ཅན་སྒྱུ་མ་བདུད་ཀྱི་ལས་དང་ལྡན་པས་ཆོས་འདི་སྟོན་ཅིང་ལ་ལ་ནི་ཕོ་མཚན་མེད་པར་བྱས། ལ་ལ་ནི་མོ་མཚན་མེད་པར་བྱས། ལ་ལ་ནི་སྐྲ་དང་ཁ་སྤུ་བྲེགས།
en: He preaches a doctrine that is linked to Māra ’s activity. From some he removes their female sex organs, and from some the male. He shaves off the hair and beards of some.

source: ལ་ལ་ནི་གོས་ཚོན་ཅན་བསྐོན། ལ་ལ་ནི་གོས་དཀར་པོ་བསྐོན།
en: To some he gives dyed robes and to others white.

source: ལ་ལ་ནི་ལྷར་སྐྱེ་བར་སྟོན།
en: To some he gives teaching so that they may obtain birth as a god;

source: ལ་ལ་ནི་མིར་སྐྱེ་བར། ལ་ལ་ནི་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེ་བར།
en: to some, birth as a human; to some, birth as an animal;

source: ལ་ལ་ནི་ཡི་དགས་སུ་སྐྱེ་བར།
en: to some, birth as a preta;

source: ལ་ལ་ནི་སེམས་ཅན་དམྱལ་བར་སྐྱེ་བར། ལ་ལ་ནི་འཆི་འཕོ་དང་། སྐྱེ་བ་མེད་པར་བྱ་བའི་ཆོས་སྟོན་ཏོ། །བདུད་ཀྱི་ལས་ཀྱི་ལམ་ལ་བརྩོན་ཞིང་བུད་མེད་བསྒྱུར་བའི་སྒྱུ་དང་ལྡན་པ་དགེ་སྦྱོང་འོད་ཞི་སྤོས་སྣང་དཔལ་དེ་དགེ་སྦྱོང་གི་གཟུགས་ཀྱིས་རབ་ཏུ་སླུ་བ་ཡིན་གྱིས་བདག་ཅག་འདི་ནས་དོང་སྟེ།
en: to some, birth as a hell being; and to some, the ending of birth, death, and transmigration altogether. That monk Splendorous with the Gentle Glow of Light and Fragrance, engaged in the conduct of Māra, duplicitous in having contacts with women, is breaking his vows while assuming the appearance of a monk.

source: དེའི་གཟུགས་དང་རྟགས་འཛིན་པ་ཡང་མི་མཐོང་བ་དང་། དེའི་ཚིག་ཀྱང་ཅུང་ཟད་ཀྱང་མི་ཐོས་པར་འདོད་དོ།
en: For that reason we should now depart from this place so that we do not have to witness his stealing of sexual organs or hear his teachings.’

source: །དེ་ནས་དེ་ཉིད་ན་ཤོར་བ་གཞོན་ནུའི་ཚུལ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེས་ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Among those who were talking in this manner there was a soldier by the name of Kumārabhṛta.

source: །ཁོ་བོའི་ཆུང་མ་དང་། གཡོག་མོ་དང་བུ་མོ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དགེ་སྦྱོང་མ་རུངས་པ་འདིས་མོ་མཚན་མེད་པར་བྱས་ཏེ།
en: He said, ‘All my wives, daughters, and women of the harem had their female sex organs removed and male organs magically planted by that rotten monk.

source: སྐྱེས་པའི་དབང་པོར་སྤྲུལ་ནས་ཐམས་ཅད་ཀྱི་མགོ་བྲེགས་ཏེ་གོས་ཚོན་ཅན་བསྐོན་ནས་ཁོ་བོ་གཅིག་པུ་མྱ་ངན་གྱིས་ནོན་ཏེ།
en: All of them had their heads shaven and were then given dyed robes by him. And I am left alone, lost in grief.

source: ཐ་ན་བདག་ཅག་ཐམས་ཅད་འདུས་ལ་གང་དུ་དགེ་སྦྱོང་མ་རུངས་པ། དགེ་སྦྱོང་སྒྱུ་མ་བདུད་ཀྱི་ཞགས་པ་ལ་བརྩོན་པ་འདིའི་སྒྲ་དང་། སྐད་ཀྱང་མི་ཐོས་ན་མཐོང་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པའི་རི་ཁྲོད་ཉམ་ང་བར་འདོང་གིས་ཚུར་ཤོག་ཅེས་བྱས་པ་དང་། དེ་དག་ཐམས་ཅད་དགའ་སྟེ་དེ་བཞིན་ནོ་ཞེས་ཟེར་རོ།
en: Let us all gather together and go into the rugged wilderness where we will not hear the sound or talk of that fake and rotten monk who employs Māra ’s snares. Let us reconnoiter first.’ “Enthusiastically, they all replied, ‘Let’s do so!’

source: །དེ་ནས་ཤོར་བ་གཞོན་ནུའི་ཚུལ་དང་། ཐེ་ཚོམ་དུ་གྱུར་པའི་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་དང་ལྷན་ཅིག་ཏུ་དེ་ནས་དོང་སྟེ།
en: “The soldier Kumārabhṛta then set forth together with those many tens of millions of individuals, who were full of doubt, to a place on the outer fringes of inhabited lands, deep in the rugged mountain wilderness.

source: ཡུལ་མཐའ་འཁོབ་ཀྱི་རི་ཁྲོད་ཉམ་ང་བར་དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་སྤྱད་པ་སྤྱོད་ཅིང་སེམས་ཅན་དེ་དག་ལ་འདི་སྐད་ཅེས་ཆོས་སྟོན་ཏོ།
en: There, he lived the life of a sage, preaching the following doctrine to all those people:

source: །འཁོར་ལ་ལས་ཐར་བ་ཡང་མེད། ལེགས་པར་བྱས་པ་དང་། ཉེས་པར་བྱས་པའི་ལས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་ཡང་མེད་ན།
en: ‘There is no liberation from saṃsāra and no ripening of the results of good or bad actions.

source: དེར་ཆད་པར་སྨྲ་བའི་དགེ་སྦྱོང་བདུད་ཀྱི་ལས་ཀྱི་ལམ་ལ་བརྩོན་པ་ཞིག་བྱུང་གིས།
en: There is, at this time, a monk who preaches nihilism—a vow breaker who indulges in the activities of Māra.

source: གང་དག་དེ་ལ་བལྟ་བའི་ཕྱིར་འགྲོ་བ་དང་། གང་དག་གུས་པར་སྨྲ་བ་དང་། གང་དག་དེའི་ཆོས་ཉན་པ་དེ་དག་སེམས་གཡེངས་པ་ཡིན་ཏེ།
en: Those who approach him for an audience, salute him, and listen to his teachings become mentally distracted.

source: དེ་དག་མགོ་བྲེགས། ཁྱིམ་ནས་ཕྱུང་། གོས་ཚོན་ཅན་བསྐོན། དུར་ཁྲོད་དུ་སྤྱད་པ་སྤྱོད་དུ་བཅུག །སློངས་མོ་བའི་སྤྱོད་པ་ལ་འཛུད།
en: He shaves their heads, causes them to leave home, gives them dyed robes, and has them live in cemeteries.

source: ཟན་ཟ་གཅིག་པར་བྱེད།
en: He forces them to beg and allows them to eat only once a day.

source: ལྟ་བ་མི་བཟད་པའི་ཡིད་དང་ལྡན་པ་དང་། རྟག་ཏུ་ཡིད་འབྱུང་བར་བྱེད།
en: Because of him their minds are warped by wrong views and they are continually upset.

source: དབེན་པར་གནས་པ་ལ་དགའ་བ་དང་། གནས་ཁང་དུ་བཅུག །འདོད་པའི་དགའ་བའི་གླུ་གར་དང་། ཕྲེང་བ་དང་། དྲི་དང་། བྱུག་པ་དང་། རྒྱན་དང་། ལྷབ་ལྷུབ་དང་། འཁྲིག་པའི་ཆོས་དང་། ཆང་ར་རོ་བར་འགྱུར་བའི་བཏུང་བ་སྤངས་ཤིང་སྨྲ་བ་ཉུང་བར་བྱེད་དེ།
en: They are content to live in seclusion and make do without bedsteads. He also deprives them of sensory and erotic pleasures, dance, song, perfume, scented oils, ornaments, jewelry, and sexual relationships. He forbids them to drink liquor or wine and allows them to eat only a little.

source: དེ་ལྟ་བུའི་དགེ་སྦྱོང་གི་གཟུགས་ཀྱིས་ཆད་པར་སྨྲ་བ། བདུད་ཀྱི་ལས་ལ་བརྩོན་པ་དེ་སེམས་ཅན་རྣམས་ཀྱི་དགྲར་གྱུར་པ་ཞིག་བྱུང་སྟེ།
en: Doing such, he is an enemy of beings who preaches nihilism in the guise of a monk while engaging in the ways of Māra

source: དགེ་སྦྱོང་གཽ་ཏ་མ་དེའི་བྱེད་པ་ནི་སྔོན་མ་ཐོས་མ་མཐོང་བ་ཡིན་པར་ཁོ་བོས་རྟོགས་སོ་ཞེས་དེས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་དེ་ལྟ་བུའི་སྡིག་པ་ཅན་གྱི་ལྟ་བ་འཛིན་དུ་བཅུག་གོ།
en: I have exposed the acts of this monk, Gautama, which were previously unheard of and unseen.’ “Through this speech of Kumārabhṛta many hundreds of thousands of millions of beings fell for his evil views.

source: །དེ་ནས་དུས་གཞན་ཞིག་ན་དགེ་སྦྱོང་ཆེན་པོ་ཨུད་པ་ལའི་གདོང་གིས་ཐོས་པ། ག་ཤེད་ཀྱི་རི་ཁྲོད་ན་ཁ་ཅིག་བདག་ཉིད་ཀྱང་ལམ་ངན་པར་ཞུགས་ཤིང་གཞན་ཡང་ལྟ་བ་མི་བཟད་པ་འཛིན་དུ་འཇུག་སྟེ།
en: “Subsequent to this, the great monk Utpalavaktra heard that in a certain mountain wilderness there were people who not only were established on the wrong path themselves but also induced others to adopt the same distorted views and speak badly about the Three Jewels.

source: དཀོན་མཆོག་གསུམ་ལ་མི་སྙན་པ་སྒྲོགས་སོ་ཞེས་ཐོས་ནས་དེ་འདི་སྙམ་དུ་སེམས་སོ། །བདག་གིས་སེམས་ཅན་འདི་དག་སྡིག་པའི་ལྟ་བར་སོང་བ་ལས་ཡོངས་སུ་ཐར་བར་མ་བྱས་ཤིང་ཡང་དག་པའི་ལྟ་བ་ལ་མ་བཀོད་ན་བདག་དགེ་སྦྱོང་དུ་གྱུར་པ་དོན་མེད་དོ།
en: He thought to himself, ‘If ultimately I don’t liberate those beings from the evil of their wrong views and don’t establish them in the right views, then my life as a monk will have become worthless.

source: །མ་འོངས་པའི་དུས་ན་ལྡོངས་པར་གྱུར་པའི་འཇིག་རྟེན་དུ་བདག་ཇི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ།
en: How in this blind world will I realize, in the future, the unsurpassed and perfect awakening?

source: ཇི་ལྟར་རབ་ཏུ་ཉམ་ཐག་པར་གྱུར་པའི་བདུད་བཞིའི་ཞགས་པས་བཅིང་བས་བཅིངས་པའི་སེམས་ཅན་རྣམས་ཡོངས་སུ་དགྲོལ་བར་ནུས་སྙམ་སྟེ།
en: How will I teach and ultimately liberate miserable beings caught in the snares of the four māras?’

source: དེ་ནས་དགེ་སྦྱོང་ཆེན་པོ་ཨུད་པ་ལའི་གདོང་རྟུལ་བ་ཆེ་ཞིང་བརྟན་པ། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་ལ་ཞུས་ཏེ། སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མས་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་མཐའ་འཁོབ་ཀྱི་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། རི་དང་། རི་བྲག་ཉམ་ང་བའི་གནས་དེ་དང་དེ་དག་ན་སྤྱད་པ་སྤྱོད་ཅིང་དེ་དང་དེ་དག་ཏུ་སེམས་ཅན་དེ་དག་ལ་ཅི་ནས་སེམས་ཅན་དེ་དག་སྡིག་པའི་ལྟ་བར་སོང་བ་ལས་བཟློག་སྟེ།
en: “The great monk Utpalavaktra, steadfast, courageous, and compassionate, having then requested the thus-gone Splendorous with the Gentle Glow of Light and Fragrance’s permission, set forth on his journey to all those towns, villages, hamlets, and marketplaces located in the rugged mountain wilderness in the frontier areas. Traveling through all these places in the company of hundreds of thousands, he taught the Dharma to all those misguided beings.

source: ཡང་དག་པའི་ལྟ་བ་ལ་བཙུད་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བཀོད།
en: He made those beings turn away from the evil of their wrong views, set them on the path of the right views, and established them on the path to unsurpassed and perfect awakening.

source: གཞན་ལ་ལ་ནི་རང་སངས་རྒྱས་ཀྱི་ཐེག་པར་སྨོན་པ་ལ། ལ་ལ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ། ལ་ལ་ནི་འབྲས་བུ་ལ་བཀོད། ལ་ལ་ནི་རབ་ཏུ་ཕྱུང་།
en: Some he established in the aspiration toward the vehicle of the solitary buddhas, some toward the vehicle of the hearers, and some he established in the fruit itself. Some he induced to take up the life of renunciation.

source: ལ་ལ་ནི་དགེ་བསྙེན་གྱི་སྡོམ་པ་ལ། ལ་ལ་ནི་ཟ་གཅིག་པ་ལ། ལ་ལ་ནི་དུས་ཁྲིམས་པ་ལ། ལ་ལ་ནི་སྐྱབས་གསུམ་དུ་འགྲོ་བ་ལ་བཀོད་པ་དེ་ལྟ་བུར་ཆོས་བསྟན་ཏོ།
en: Some he established in the vows of a lay practitioner, some in the vows of fasting and abstinence, and some in the vows of the threefold refuge.

source: །བུད་མེད་དག་ལ་ནི་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་འདི་བཤད་དེ། བུད་མེད་ཀྱི་དངོས་པོ་ལས་བསྒྱུར་ནས་སྐྱེས་པ་ལ་བཀོད་དོ།
en: To women he taught the Ratnaketu dhāraṇī, thus preventing them from becoming women again and establishing them in the state of manhood.

source: །སྲོག་ཆགས་མང་པོ་གང་དེ་བཞིན་གཤེགས་པ་ལ་ཐེ་ཚོམ་དུ་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་སྡིག་པའི་ལྟ་བར་སོང་བ་དེ་ལས་བཟློག་སྟེ། ཉེས་པ་འཆགས་སུ་བཅུག་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཀོད་དོ།
en: “With regard to the many tens of millions of beings who harbored doubts when being near the Thus-Gone One, he made all of them turn away from the evil of their wrong views, taught them the perils of vice, and established them on the path to unsurpassed and perfect awakening.

source: །དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་དེ་ཉིད་ལ་ཕུལ་ནས་རབ་ཏུ་ཕྱུང་ངོ་། །ཤོར་བ་གཞོན་ནུའི་ཚུལ་ནི་མ་གཏོགས་ཏེ།
en: He brought them into the presence of the thus-gone Splendorous with the Gentle Glow of Light and Fragrance where they all, except for the soldier Kumārabhṛta, took up the life of renunciation.

source: དེས་འདི་ལྟར་ཨུད་པ་ལའི་གདོང་འདིས་བདག་གི་འཁོར་རྣམས་བསླུས་ཏེ་ཁྲིད་ཀྱིས།
en: Kumārabhṛta, for his part, made the following aspiration:

source: བདག་གིས་ཀྱང་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བདུད་བྱས་ཏེ།
en: ‘As the monk Utpalavaktra is leading my followers astray, may I become a māra in the buddha field where he is to attain unsurpassed and perfect awakening so that I will be able to harm him from the moment he enters the womb.

source: འདི་ལྟར་མངལ་ན་འདུག་པ་ཚུན་ཆད་འདི་ལ་རྣམ་པར་འཚེའོ། །དེ་ནས་ཕྱིས་བཙས་ནས་ཀྱང་གཞོན་ནུ་རྩེད་མོ་བྱེད་པ་དང་། བཟོའི་ལས་ཀྱི་མཐའ་དང་། ཀློག་ཅིང་འདུག་པ་དང་། དགའ་བའི་རྩེད་མོའི་ཕྱིར་བཙུན་མོའི་འཁོར་གྱི་ནང་དུ་སོང་བ་ནས་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་གི་བར་དུ་སྐྲག་པར་བྱའོ། །བགེགས་བྱའོ། །བྱང་ཆུབ་ཐོབ་ནས་ཀྱང་བསྟན་པ་གཞིག་པར་བྱའོ་ཞེས་སྨོན་ལམ་བཏབ་བོ།
en: Later, after he is born, may I terrorize and create obstacles for him when he plays as a child, learns arts and crafts, learns to read, enjoys amorous pastimes in the harem . . . until he ascends to the seat of awakening. Should he attain awakening, may I sabotage his teachings.’

source: །དེ་ནས་དགེ་སྦྱོང་ཨུད་པ་ལའི་གདོང་གིས་ཤོར་བ་གཞོན་ནུའི་ཚུལ་གྱིས་སྨོན་ལམ་དེ་ལྟར་བརྟུལ་ཏེ་བཏབ་པ་ལ་མཐུ་ཆེན་པོ་དང་འབད་པ་དྲག་པོས་དད་པར་བྱས་ཏེ་སྡིག་པའི་ལྟ་བ་ཐིབས་པོ་དེ་ལས་བཟློག་ནས་ཉེས་པ་འཆགས་སུ་བཅུག་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆབ་ཏུ་སེམས་བསྐྱེད་དུ་བཅུག་གོ།
en: “The great monk Utpalavaktra, however, through his great courage full of effort and painful sacrifice, managed to instill faith in the soldier Kumārabhṛta, who had been so determined in his aspiration. He made him turn away from the evil of his wrong views, taught him the perils of vice, and planted in him the aspiration to attain unsurpassed and perfect awakening.

source: །དེ་ནས་ཤོར་བ་གཞོན་ནུའི་ཚུལ་རབ་ཏུ་དུལ་ཞིང་དད་པ་སྐྱེས་ནས་འདི་སྐད་དུ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཁྱོད་གང་གི་ཚེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེའི་ཚེ་བྱང་ཆུབ་ཐོབ་ནས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་དུ་གསོལ་ཞེས་སྨོན་ལམ་བཏབ་བོ།
en: Consequently, the soldier Kumārabhṛta, now tame and faithful, made the following wish: “ ‘O most compassionate Utpalavaktra! At the time when you have attained unsurpassed and perfect awakening, may you provide me with the prophecy of my attaining unsurpassed and perfect awakening.’

source: །བཞིན་བཟངས་དག་དེའི་ཚེ་དེའི་དུས་ན་གང་གིས་དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་དེ་འཁོར་དང་བཅས་པ་ལ་མཆོད་པ་དང་རིམ་གྲོ་རྣམ་པ་དུ་མ་བྱས་ནས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་བཅས་ཏེ་ཁྱིམ་ནས་བྱུང་ནས་རབ་ཏུ་བྱུང་ཞིང་།
en: O good people, should you have any doubts, uncertainties, or other such thoughts, then know that Utpalavaktra, on that occasion, attended upon the thus-gone Splendorous with the Gentle Glow of Light and Fragrance and his retinue with manifold offerings and then left the household life and became a wandering mendicant together with hundreds of thousands of millions of beings.

source: སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་ནི་སྡིག་པའི་ལྟ་བར་སོང་བ་ལས་བཟློག་སྟེ།
en: He turned infinite hundreds of thousands of millions of beings away from the evil of their wrong views.

source: ཐེག་པ་གསུམ་ལ་བཀོད། སེམས་ཅན་དཔག་ཏུ་མེད་པ་ནི་འབྲས་བུ་ལ་བཀོད།
en: He set infinite numbers of beings upon the three paths and established them in the fruits thereof.

source: བུད་མེད་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ་ནི་སྐྱེས་པ་ཐོབ་པར་བྱས་པའི་རྒྱལ་པོ་ཨུད་པ་ལའི་གདོང་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་ཐེ་ཚོམ་མམ། ཡིད་གཉིས་སམ།
en: For infinite hundreds of thousands of millions of women, he enabled them to attain the state of manhood.

source: སོམ་ཉི་ཟ་བར་གྱུར་ན་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ང་དེའི་ཚེ་དེའི་དུས་ན་གླིང་བཞི་ལ་དབང་བའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཨུད་པ་ལའི་གདོང་ཞེས་བྱ་བར་གྱུར་ཏེ། ངས་དེ་ལྟ་བུའི་སྐྱེས་བུའི་མཐུ་བྱས་སོ། །བཞིན་བཟངས་དག་དེའི་ཚེ་དེའི་དུས་ན་བཙུན་མོ་དམ་པ་ལྷ་མཛེས་ཞེས་བྱ་བ་གང་གིས་དགེ་སྦྱོང་ཐོབ་པར་གྱུར་པ་དེ་གཞན་ཡིན་སྙམ་དུ་ཐེ་ཚོམ་མམ། ཡིད་གཉིས་སམ། སོམ་ཉི་ཟ་བར་གྱུར་ན་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཙུན་མོ་དམ་པ་ལྷ་མཛེས་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: “This may not be immediately obvious to you, but at that time, during those events, I was the king Utpalavaktra, the universal monarch ruling over the four continents. It was I who discharged my duties as a man. And if again, O good people, you should have any doubts, uncertainties, or other such thoughts with regard to Surasundarī, the chief queen who went forth during the time those events occured, you should know that this was the great bodhisattva Maitreya during that particular time. O good people, you may have doubts, uncertainties, or other such thoughts with regard to the soldier Kumārabhṛta and his retinue of tens of millions of beings who took part in the events of that time, as it may not be immediately obvious to you that this was Māra, the evil one, during that particular time. Because I set his followers, at that time, upon the path of renunciation, he first took umbrage with me but then made a wish that once I myself had attained unsurpassed and perfect awakening, I would prophesy the same for him.
